In [1]:
import pandas

In [2]:
zam_praha = pandas.read_csv("zam_praha.csv")
zam_plzeň = pandas.read_csv("zam_plzeň.csv")
zam_liberec = pandas.read_csv("zam_plzeň.csv")

In [3]:
zam_praha["mesto"] = "Praha"
zam_plzeň["mesto"] = "Plzeň"
zam_liberec["mesto"] = "Liberec"

In [4]:
zamestnanci = pandas.concat([zam_praha, zam_plzeň, zam_liberec], ignore_index=True)
zamestnanci.head
zamestnanci.shape

(61, 5)

In [5]:
zamestnanci.to_csv('zamestnanci.csv', index=False)

In [6]:
platy = pandas.read_csv("platy_2021_02.csv")
platy.shape

(43, 2)

In [7]:
zamestnanci_s_platy = pandas.merge(zamestnanci, platy, on=['cislo_zamestnance'], how="left")
zamestnanci_s_platy.info()
zamestnanci_s_platy.head

<class 'pandas.core.frame.DataFrame'>
Int64Index: 61 entries, 0 to 60
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   jmeno              61 non-null     object
 1   prijimeni          61 non-null     object
 2   telefonni_cislo    61 non-null     object
 3   cislo_zamestnance  61 non-null     int64
 4   mesto              61 non-null     object
 5   plat               49 non-null     float64
dtypes: float64(1), int64(1), object(4)
memory usage: 3.3+ KB

<bound method NDFrame.head of        jmeno prijimeni   telefonni_cislo  cislo_zamestnance    mesto     plat
0      Brian      Hall  +421 949 656 098                 30    Praha  33500.0
1      Marta  Kolářová       730 456 163                 32    Praha  53000.0
2       John   Moravec       725 092 179                 33    Praha  38400.0
3   Dominika   Kopecká       722 747 626                 34    Praha  36800.0
4     Marcel     Hájek  +421 902 928 669                 35    Praha      NaN
..       ...       ...               ...                ...      ...      ...
56     Kayla  Urbanová       737 772 985                 24  Liberec  44200.0
57     Roman    Moreno       722 284 985                 26  Liberec  59600.0
58  Bohumila     Smith       608 121 912                 27  Liberec  45100.0
59   Blažena     Smith  +421 51 828 2591                 28  Liberec  38100.0
60   Phillip      Malý       731 594 560                 29  Liberec  48900.0

[61 rows x 6 columns]>

In [8]:
len(zamestnanci_s_platy[zamestnanci_s_platy['plat'].isna()])
#zamestnanci_s_platy.isna().sum()

12

12 zaměstnanců již ve firmě nepracuje

In [9]:
pocet_zamestnancu_nepracuji = zamestnanci_s_platy[zamestnanci_s_platy['plat'].isna()]
pocet_zamestnancu_nepracuji

        jmeno prijimeni   telefonni_cislo  cislo_zamestnance    mesto  plat
4      Marcel     Hájek  +421 902 928 669                 35    Praha   NaN
12   Karolína     Short       721 589 083                 53    Praha   NaN
13   Michelle   Vlčková  +421 41 720 7806                 54    Praha   NaN
16       John    Bailey       775 021 116                 58    Praha   NaN
17    William   Shelton  +421 47 745 8219                 60    Praha   NaN
18  Miroslava    Veselá       774 029 254                 62    Praha   NaN
21     Nathan   Svoboda       728 710 923                 66    Praha   NaN
24     Robert      Říha       727 351 984                 72    Praha   NaN
33   Jindřich    Howell  +421 39 043 0948                 10    Plzeň   NaN
34  Alexander  Martinez       721 195 689                 13    Plzeň   NaN
49   Jindřich    Howell  +421 39 043 0948                 10  Liberec   NaN
50  Alexander  Martinez       721 195 689                 13  Liberec   NaN

In [10]:
pocet_zamestnancu_nepracuji.to_csv('pocet_zamestnancu_nepracuji.csv', index=False)

In [11]:
zamestnanci_s_platy = zamestnanci_s_platy.dropna(subset=["plat"])
zamestnanci_s_platy.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 49 entries, 0 to 60
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   jmeno              49 non-null     object
 1   prijimeni          49 non-null     object
 2   telefonni_cislo    49 non-null     object
 3   cislo_zamestnance  49 non-null     int64
 4   mesto              49 non-null     object
 5   plat               49 non-null     float64
dtypes: float64(1), int64(1), object(4)
memory usage: 2.7+ KB

průměrný plat zaměstnanců

In [12]:
zamestnanci_s_platy.groupby('mesto')['plat'].mean()

mesto
Liberec    44792.857143
Plzeň      44792.857143
Praha      43295.238095
Name: plat, dtype: float64

In [13]:
vykazy = pandas.read_csv("vykazy.csv")
vykazy

          date  hours project  emloyee_id
0   2021-02-01    2.5     F30          13
1   2021-02-01    3.4     W05          70
2   2021-02-01    2.1     JL9          72
3   2021-02-01    5.2     F30           3
4   2021-02-01    2.4     TE1          54
5   2021-02-01    4.1     TE1          83
6   2021-02-01    5.4     W05          92
7   2021-02-01    2.2     YLI          34
8   2021-02-01    2.7     YLI          84
9   2021-02-01    4.4     W05          30
10  2021-02-02    5.6     F30          53
11  2021-02-02    2.6     W05          47
12  2021-02-02    2.4     YLI          44
13  2021-02-02    3.1     YLI          40
14  2021-02-02    5.3     YLI          10
15  2021-02-02    3.6     YLI          53
16  2021-02-02    5.6     F30          56
17  2021-02-03    4.0     W05          53
18  2021-02-03    4.6     TE1          86
19  2021-02-03    2.6     F30          18
20  2021-02-03    2.8     TE1          47
21  2021-02-03    2.6     YLI          34
22  2021-02-03    3.7     YLI          96
23  2021-02-03    5.2     W05          57
24  2021-02-03    5.5     W05          40
25  2021-02-03    5.4     YLI          86
26  2021-02-03    2.1     TE1          87

In [26]:
vykazy.groupby('project')['hours'].sum()

project
F30    21.5
JL9     2.1
TE1    16.0
W05    30.5
YLI    31.0
Name: hours, dtype: float64

In [15]:
import pandas as pd

In [16]:
vykazy_prejmenovani = vykazy.rename(columns={'emloyee_id':'cislo_zamestnance'}, inplace=False)
vykazy_prejmenovani.info()
vykazy_prejmenovani.head()
vykazy_prejmenovani.to_csv('vykazy_prejmenovani.csv', index=False)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 27 entries, 0 to 26
Data columns (total 4 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   date               27 non-null     object
 1   hours              27 non-null     float64
 2   project            27 non-null     object
 3   cislo_zamestnance  27 non-null     int64
dtypes: float64(1), int64(1), object(2)
memory usage: 992.0+ bytes

In [17]:
statistika_vykazanych_hodin = pandas.merge(zamestnanci,vykazy_prejmenovani, on=['cislo_zamestnance'], how ="left")
statistika_vykazanych_hodin.info()
statistika_vykazanych_hodin.head()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 66 entries, 0 to 65
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   jmeno              66 non-null     object
 1   prijimeni          66 non-null     object
 2   telefonni_cislo    66 non-null     object
 3   cislo_zamestnance  66 non-null     int64
 4   mesto              66 non-null     object
 5   date               24 non-null     object
 6   hours              24 non-null     float64
 7   project            24 non-null     object
dtypes: float64(1), int64(1), object(6)
memory usage: 4.6+ KB

,jmeno,prijimeni,telefonni_cislo,cislo_zamestnance,mesto,date,hours,project
0,Brian,Hall,+421 949 656 098,30,Praha,2021-02-01,4.4,W05
1,Marta,Kolářová,730 456 163,32,Praha,NaN,NaN,NaN
2,John,Moravec,725 092 179,33,Praha,NaN,NaN,NaN
3,Dominika,Kopecká,722 747 626,34,Praha,2021-02-01,2.2,YLI
4,Dominika,Kopecká,722 747 626,34,Praha,2021-02-03,2.6,YLI

In [24]:
statistika_vykazanych_hodin.groupby("mesto")["hours"].sum()

mesto
Liberec    15.6
Plzeň      15.6
Praha      57.5
Name: hours, dtype: float64

In [25]:
statistika_vykazanych_hodin.groupby("project")["hours"].sum()

project
F30    31.8
JL9     2.1
TE1     5.2
W05    25.1
YLI    24.5
Name: hours, dtype: float64